users/dotfiles/doom-emacs/modules/private/my-org/config.el
(load! "setting")
(use-package! ox-hugo)
(use-package! ob-session-async)

(after! org
  (when IS-LINUX
    (setq org-id-locations-file (concat org-directory "/cache/.linux-orgids"))
    )

  (when IS-MAC
    (setq org-id-locations-file (concat org-directory "/cache/.mac-orgids"))
    )

  (setq org-clock-into-drawer t)
  (add-hook! 'org-mode-hook 'auto-revert-mode)
  (add-hook! 'dired-mode-hook 'org-download-enable)
  ;; (setq-hook! 'org-mode-hook fill-column 80)
  ;; (setq-hook! 'org-mode-hook org-superstar-mode 1)
  (setq org-directory "~/Documents/org-notes")
  (setq org-log-into-drawer t)
  (setq org-agenda-start-day "-1d")
  (setq org-agenda-span 2)
  (setq org-time-clocksum-format '(:hours "%d" :require-hours t :minutes ":%02d" :require-minutes t))
  (setq org-archive-location (concat "%s_archive_" (format-time-string "%Y" (current-time)) "::"))
  ;; Removes clocked tasks with 0:00 duration
  (setq org-clock-out-remove-zero-time-clocks t)
  ;; Change task state to STARTED when clocking in
  (setq org-clock-in-switch-to-state "⚔ INPROCESS")
  (setq org-src-fontify-natively t
        org-src-preserve-indentation t
        org-src-tab-acts-natively t
        org-src-window-setup 'current-window)
  (setq org-agenda-time-leading-zero t)

  ;;Markdown
  (eval-after-load "org"
    '(require 'ox-md nil t))
  ;;https://orgmode.org/worg/org-contrib/babel/examples/fontify-src-code-blocks.html

  (defun org-show-two-levels ()
    (interactive)
    (org-content 2))

  (setq org-download-timestamp "%Y%m%d_%H%M%S")

  (add-hook! 'org-mode-hook 'org-show-two-levels)
  (add-hook! 'after-init-hook 'org-id-update-id-locations)

  (add-hook! 'unpackaged/org-return-dwim 'unpackaged/org-fix-blank-lines)
  (define-key org-mode-map (kbd "C-c ;") 'org-time-stamp-inactive)
  (define-key org-mode-map (kbd "RET") 'unpackaged/org-return-dwim)
  (setq org-plantuml-jar-path (expand-file-name "~/.myscript/plantuml"))
  )

(use-package! org-starter
  :custom
  ;; Enable external configuration files loaded from org-starter-path
  (org-starter-load-config-files t)
  :config
  (org-starter-def "~/Documents/org-notes"
    :files
    ("posts/myself/love.org"         :key "l" :refile (:maxlevel . 5 ))
    ("posts/myself/qing.org"         :key "q" :refile (:maxlevel . 5 ))
    ("posts/myself/plan.org"         :key "p" :refile (:maxlevel . 5 ))
    )
  (org-starter-def "~/Documents/org-notes/braindump"
    :files
    ("myself-private/" :agenda t)
    ("myself-private/GTD/gtd.org"                      :key "g" :refile (:maxlevel . 5))
    ("myself-private/GTD/notes.org"                    :key "n" :refile (:maxlevel . 5 ))
    ("myself-private/GTD/myself.org"                    :key "m" :refile (:maxlevel . 5 ))
    ("myself-private/GTD/Habit.org"                     :key "h" :refile (:maxlevel . 5 ))
    ;;
    ("guangtao/" :agenda t)
    ("guangtao/learn_music.org"          :agenda t :key "M" :refile (:maxlevel . 5 ))
    ("guangtao/guangtao's_library.org"       :key "b" :refile (:maxlevel . 5 ))
    ("guangtao/guangtao's_feed.org"         :agenda t :key "f" :refile (:maxlevel . 5 ))
    ;;
    ("life/" :agenda t)
    ("life/life_goods.org"     :key "s" :refile (:maxlevel . 5 ))
    ("gaming/" :agenda t)
    ("journals/" :agenda t)
    ("hardware/" :agenda t)
    ("system/" :agenda t)
    ("deployment/" :agenda t)
    ("cs/" :agenda t)
    ("programming/" :agenda t)
    ("nix/" :agenda t)
    ("emacs/" :agenda t)
    ("security/" :agenda t)
    ("financial/" :agenda t)
    ("network/" :agenda t)
    ("data-science/" :agenda t)        
    )
  (org-starter-def "~/.config/nixpkgs/dotfiles/doom-emacs/"
    :files
    ("config.org" :key "c" :refile (:maxlevel . 5))
    ("meow.org" :key "w" :refile (:maxlevel . 5))
    )
  (org-starter-def "~/.config/nixpkgs"
    :files
    ("README.org")
    ("global-readme.org")
    ("dotfiles/wallpaper/wallpaper.org" :agenda nil)
    )

  (defhydra gtrun/hydra-org-starter nil
    "
  Org-starter-files
  ^^^^------------------------------------------------
 _c_: config.org  _g_: gtd.org     _l_: love.org
 _n_: note        _h_: Habit.org    _w_: meow.org
 _m_: myself      _p_: Plan.org
 _b_: my-books    _f_: feed
 _s_: life-goods
  "

    ("c" org-starter-find-file:config)
    ("w" org-starter-find-file:meow)
    ("g" org-starter-find-file:gtd)
    ("s" org-starter-find-file:life_goods)
    ("n" org-starter-find-file:notes)
    ("f" org-starter-find-file:feed)
    ("m" org-starter-find-file:myself)
    ("l" org-starter-find-file:love)
    ("h" org-starter-find-file:Habit)
    ("p" org-starter-find-file:plan)
    ("b" org-starter-find-file:guangtao\'\s_library)
    )
  :commands org-starter-load-all-files-in-path
  :hook
  (after-init . org-starter-load-all-files-in-path)
  :bind
  (
   ("C-c e" . org-starter-select-file))
  ;; "C-c e" . org-starter-refile-by-key))
  )
