users/dotfiles/doom-emacs/config.org
** org-superstar

#+begin_src emacs-lisp :tangle  "./modules/private/my-org/packages.el"
(package! org-superstar)
#+end_src

#+begin_src emacs-lisp :tangle "./modules/private/my-org/config.el"
(use-package! org-superstar
  :hook
  (org-mode . org-superstar-mode)
  :config
  (setq org-superstar-headline-bullets-list '("☰" "☷" "☵" "☲"  "☳" "☴"  "☶"  "☱" ))
)
#+end_src

** org-ql
:PROPERTIES:
:ID:       13ea46d9-4bc3-49fd-b776-e0259d977b03
:END:

- [2021-01-08 Fri 17:49] <- [[id:ccfe887a-cb1b-4671-8d35-44d46f98b0ef][org-z]]
- [[https://github.com/tpeacock19/org-ql-config][tpeacock19/org-ql-config]]
#+begin_src emacs-lisp :tangle  "./modules/private/my-org/packages.el"
(package! org-ql :recipe (:host github :repo "alphapapa/org-ql"
                         :files ("*.el")
                         ))
#+end_src

#+begin_src emacs-lisp :tangle "./modules/private/my-org/config.el"
(use-package! org-ql)
#+end_src

#+begin_src emacs-lisp :tangle  "./modules/private/my-org/packages.el"
(package! helm-org-rifle)
#+end_src

#+begin_src emacs-lisp :tangle "./modules/private/my-org/config.el"
(use-package! helm-org-rifle)
#+end_src


** org-book

#+begin_src emacs-lisp :tangle  "./modules/private/my-org/packages.el"
(package! org-books :recipe (:host github :repo "lepisma/org-books"))
#+end_src

#+begin_src emacs-lisp :tangle "./modules/private/my-org/config.el"
(use-package! org-books
  :config
  (setq org-books-file "~/Documents/org-notes/braindump/guangtao/guangtao_library.org")
  )
#+end_src

** org-z
:PROPERTIES:
:ID:       ccfe887a-cb1b-4671-8d35-44d46f98b0ef
:END:
 - [2021-01-08 Fri 17:49] -> [[id:132bd909-bf8d-40c7-8809-c50dc3226002][helm-rg]]
 - [2021-01-08 Fri 17:49] -> [[id:13ea46d9-4bc3-49fd-b776-e0259d977b03][org-ql]]

#+begin_src emacs-lisp :tangle  "./modules/private/my-org/packages.el"
(package! org-z :recipe (:host github :repo "landakram/org-z"
                         :files ("*.el")
                         ))
#+end_src

#+begin_src emacs-lisp :tangle "./modules/private/my-org/config.el"
(use-package! org-z
  :init
  (define-key org-mode-map (kbd "C-c C-;") 'org-z-insert-link)
  (require 'org-z-helm)
  ;;(require 'org-z-selectrum)
  :config
  (org-z-mode 1)
  (setq org-z-directories  '("~/Documents/org-notes/braindump"
                             "~/Documents/org-notes/braindump/guangtao"
                             "~/Documents/org-notes/braindump/journals"
                             "~/Documents/org-notes/braindump/cs"
                             "~/Documents/org-notes/braindump/network"
                             "~/Documents/org-notes/braindump/security"
                             "~/Documents/org-notes/braindump/life"
                             "~/Documents/org-notes/braindump/math"
                             "~/Documents/org-notes/braindump/math/my-mathematic-julia"
                             "~/Documents/org-notes/braindump/data-science"
                             "~/Documents/org-notes/braindump/deployment"
                             "~/Documents/org-notes/braindump/hardware"
                             "~/Documents/org-notes/braindump/system"
                             "~/Documents/org-notes/braindump/emacs"
                             "~/Documents/org-notes/braindump/gaming"
                             "~/Documents/org-notes/braindump/financial"
                             "~/Documents/org-notes/braindump/myself-private"
                             "~/Documents/org-notes/braindump/myself-private/GTD"
                             "~/Documents/org-notes/braindump/nix"
                             "~/Documents/org-notes/braindump/programming"
                             "~/.config/nixpkgs/dotfiles/doom-emacs"
                             ))

   )
#+end_src

#+RESULTS:
: t


** GTD

*** agenda knowledge

**** [[http://doc.norang.ca/org-mode.html][Org Mode - Organize Your Life In Plain Text!]]
:PROPERTIES:
:ID:       a9083e79-5da7-4721-817d-6a19760e3800
:END:
:BACKLINKS:
[2020-10-13 Tue 15:05] <- [[*\[\[https://www.nongnu.org/org-edna-el/#org2421cd7\]\[Org Edna\]\]][Org Edna]]
:END:

**** Sexp Entries and the Fancy Diary Display

- [[https://www.gnu.org/software/emacs/manual/html_node/emacs/Sexp-Diary-Entries.html][https://www.gnu.org/software/emacs/manual/html_node/emacs/Sexp-Diary-Entries.html]]


*** super-agenda

#+begin_src emacs-lisp :tangle "./modules/private/my-org/packages.el"
(package! org-super-agenda)
#+end_src

#+begin_src emacs-lisp :tangle "./modules/private/my-org/config.el"
(use-package! org-super-agenda
  :config
  (add-hook! 'after-init-hook 'org-super-agenda-mode)
  (require 'org-habit)
  (setq
   org-agenda-skip-scheduled-if-done t
   org-agenda-skip-deadline-if-done t
   org-agenda-include-deadlines t
   org-agenda-include-diary nil
   org-agenda-block-separator nil
   org-agenda-compact-blocks t
   org-agenda-start-with-log-mode t)
  )
#+end_src


*** org-todo-keywords

#+begin_src emacs-lisp :tangle "./modules/private/my-org/config.el"
    (setq org-todo-keywords
     '((sequence
           "TODO(t)"  ; A task that needs doing & is ready to do
           "PROJ(p)"  ; An ongoing project that cannot be completed in one step
           "INPROCESS(s)"  ; A task that is in progress
           "⚑ WAITING(w)"  ; Something is holding up this task; or it is paused
           "|"
           "☟ NEXT(n)"
           "✰ IMPORTANT(i)"
           "DONE(d)"  ; Task successfully completed
           "✘ CANCELED(c@)") ; Task was cancelled, aborted or is no longer applicable
          (sequence
           "✍ NOTE(N)"
           "FIXME(f)"
           "☕ BREAK(b)"
           "❤ LOVE(l)"
           "REVIEW(r)"
           )) ; Task was completed
        org-todo-keyword-faces
        '(
          ("TODO" . (:foreground "#ff39a3" :weight bold))
          ("INPROCESS"  . "orangered")
          ("✘ CANCELED" . (:foreground "white" :background "#4d4d4d" :weight bold))
          ("⚑ WAITING" . "pink")
          ("☕ BREAK" . "gray")
          ("❤ LOVE" . (:foreground "VioletRed4"
                                   ;; :background "#7A586A"
                                   :weight bold))
          ("☟ NEXT" . (:foreground "DeepSkyBlue"
                                   ;; :background "#7A586A"
                                      :weight bold))
          ("✰ IMPORTANT" . (:foreground "greenyellow"
                                      ;; :background "#7A586A"
                                      :weight bold))
          ("DONE" . "#008080")
          ("FIXME" . "IndianRed")
          ))
#+end_src


