users/dotfiles/doom-emacs/modules/private/my-org/config.el

(use-package! org-superstar
  :hook
  (org-mode . org-superstar-mode)
  :config
  (setq org-superstar-headline-bullets-list '("☰" "☷" "☵" "☲"  "☳" "☴"  "☶"  "☱" ))
)

(use-package! org-ql)

(use-package! helm-org-rifle)

(use-package! org-books
  :config
  (setq org-books-file "~/Documents/org-notes/braindump/guangtao/guangtao's_library.org")
  )

(use-package! org-z
  :init
  (define-key org-mode-map (kbd "C-c C-;") 'org-z-insert-link)
  (require 'org-z-helm)
  ;;(require 'org-z-selectrum)
  :config
  (org-z-mode 1)
  (setq org-z-directories  '("~/Documents/org-notes/braindump"
                             "~/Documents/org-notes/braindump/guangtao"
                             "~/Documents/org-notes/braindump/journals"
                             "~/Documents/org-notes/braindump/cs"
                             "~/Documents/org-notes/braindump/network"
                             "~/Documents/org-notes/braindump/security"
                             "~/Documents/org-notes/braindump/life"
                             "~/Documents/org-notes/braindump/math"
                             "~/Documents/org-notes/braindump/math/my-mathematic-julia"
                             "~/Documents/org-notes/braindump/data-science"
                             "~/Documents/org-notes/braindump/deployment"
                             "~/Documents/org-notes/braindump/hardware"
                             "~/Documents/org-notes/braindump/system"
                             "~/Documents/org-notes/braindump/emacs"
                             "~/Documents/org-notes/braindump/gaming"
                             "~/Documents/org-notes/braindump/financial"
                             "~/Documents/org-notes/braindump/myself-private"
                             "~/Documents/org-notes/braindump/myself-private/GTD"
                             "~/Documents/org-notes/braindump/nix"
                             "~/Documents/org-notes/braindump/programming"
                             "~/.config/nixpkgs/dotfiles/doom-emacs"
                             ))

   )

(use-package! org-super-agenda
  :config
  (add-hook! 'after-init-hook 'org-super-agenda-mode)
  (require 'org-habit)
  (setq
   org-agenda-skip-scheduled-if-done t
   org-agenda-skip-deadline-if-done t
   org-agenda-include-deadlines t
   org-agenda-include-diary nil
   org-agenda-block-separator nil
   org-agenda-compact-blocks t
   org-agenda-start-with-log-mode t)
  )

(setq org-todo-keywords
 '((sequence
       "TODO(t)"  ; A task that needs doing & is ready to do
       "PROJ(p)"  ; An ongoing project that cannot be completed in one step
       "INPROCESS(s)"  ; A task that is in progress
       "⚑ WAITING(w)"  ; Something is holding up this task; or it is paused
       "|"
       "☟ NEXT(n)"
       "✰ IMPORTANT(i)"
       "DONE(d)"  ; Task successfully completed
       "✘ CANCELED(c@)") ; Task was cancelled, aborted or is no longer applicable
      (sequence
       "✍ NOTE(N)"
       "FIXME(f)"
       "☕ BREAK(b)"
       "❤ LOVE(l)"
       "REVIEW(r)"
       )) ; Task was completed
    org-todo-keyword-faces
    '(
      ("TODO" . (:foreground "#ff39a3" :weight bold))
      ("INPROCESS"  . "orangered")
      ("✘ CANCELED" . (:foreground "white" :background "#4d4d4d" :weight bold))
      ("⚑ WAITING" . "pink")
      ("☕ BREAK" . "gray")
      ("❤ LOVE" . (:foreground "VioletRed4"
                               ;; :background "#7A586A"
                               :weight bold))
      ("☟ NEXT" . (:foreground "DeepSkyBlue"
                               ;; :background "#7A586A"
                                  :weight bold))
      ("✰ IMPORTANT" . (:foreground "greenyellow"
                                  ;; :background "#7A586A"
                                  :weight bold))
      ("DONE" . "#008080")
      ("FIXME" . "IndianRed")
      ))
