users/dotfiles/doom-emacs/modules/private/my-org/packages.el

(package! org-superstar)

(package! org-ql :recipe (:host github :repo "alphapapa/org-ql"
                         :files ("*.el")
                         ))

(package! helm-org-rifle)

(package! org-books :recipe (:host github :repo "lepisma/org-books"))

(package! org-z :recipe (:host github :repo "landakram/org-z"
                         :files ("*.el")
                         ))

(package! org-super-agenda)
