users/dotfiles/doom-emacs/modules/private/my-org/packages.el

(package! org-edna :recipe (:build (:not compile)))

(package! org-wild-notifier)

(package! notdeft :recipe (:host github :repo "hasu/notdeft"))

(unpin! org-roam)
