users/dotfiles/doom-emacs/config.org
*** org-roam

#+begin_src emacs-lisp :tangle "./modules/private/my-org/packages.el"
(unpin! org-roam)
#+end_src


#+begin_src emacs-lisp :tangle "./modules/private/my-org/config.el"
(use-package! org-roam
  :init
  (require 'org-roam-protocol)
  :config
  (setq org-roam-index-file "~/Documents/org-notes/braindump/pages/contents.org")
  ;;https://github.com/zaeph/.emacs.d/blob/0f4bf9a500ef6397b93c41cb51602bea9ab9a4c3/init.el#L3804
  ;; [[https://copingmechanism.com/2020/keeping-org-roam-daily-notes-in-a-separate-folder/][Keeping Org-roam Daily Notes in a separate folder – Coping Mechanism]]
  ;; (setq org-roam-dailies-capture-templates '(("d" "daily" plain (function org-roam-capture--get-point) ""
  ;;                                             :immediate-finish t
  ;;                                             :file-name "dailies/%<%Y-%m-%d>-${slug}"
  ;;                                             :head "#+TITLE: %<%Y-%m-%d>-${slug}\n#+created: %u\n#+last_modified: %U\n\n")))
  )
#+end_src



*** org-roam-server

- [[https://github.com/org-roam/org-roam-server][org-roam/org-roam-server: A Web Application to Visualize the Org-Roam Database]]

#+begin_src emacs-lisp :tangle  "./modules/private/my-org/packages.el"
;;(package! org-roam-server)
#+end_src

#+begin_src emacs-lisp :tangle "./modules/private/my-org/config.el"
;; (use-package! org-roam-server
;;   :config
;;   (setq org-roam-server-port 8081
;;         org-roam-server-export-inline-images t
;;         org-roam-server-authenticate nil
;;         org-roam-server-network-poll t
;;         org-roam-server-network-arrows nil
;;         org-roam-server-network-label-truncate t
;;         org-roam-server-network-label-truncate-length 60
;;         org-roam-server-network-label-wrap-length 20))
#+end_src


*** org-roam-bibtex

#+begin_src emacs-lisp :tangle  "./modules/private/my-org/packages.el"
;;(package! org-roam-bibtex)
#+end_src

#+begin_src emacs-lisp :tangle "./modules/private/my-org/config.el"
;; (use-package! org-roam-bibtex
;;   :config
;;   (add-hook 'org-mode-hook 'org-roam-bibtex-mode)
;;   :bind (:map org-roam-bibtex-mode-map
;;               ("C-c n a" . orb-note-actions)
;;               )
;;   )
#+end_src
*** org-nroam

#+begin_src emacs-lisp :tangle  "./modules/private/my-org/packages.el"
(package! nroam :recipe (:host github :repo "NicolasPetton/nroam"))
#+end_src

#+begin_src emacs-lisp :tangle "./modules/private/my-org/config.el"
(use-package! nroam
  :after org-roam
  :config
  (add-hook 'org-mode-hook #'nroam-setup-maybe))
#+end_src


*** org-ref

#+begin_src emacs-lisp :tangle  "./modules/private/my-org/packages.el"
(package! org-ref)
#+end_src

#+begin_src emacs-lisp :tangle "./modules/private/my-org/config.el"
(use-package! org-ref
  :config
  (defsubst dnd-unescape-uri (uri)
  (replace-regexp-in-string
   "%[A-Fa-f0-9][A-Fa-f0-9]"
   (lambda (arg)
     (let ((str (make-string 1 0)))
       (aset str 0 (string-to-number (substring arg 1) 16))
       str))
   uri t t))
  (setq org-ref-default-bibliography '("~/Documents/org-notes/braindump/bibliography/myBibliography.bib"))
  (setq bibtex-completion-bibliography "~/Documents/org-notes/braindump/bibliography/myBibliography.bib")
  )
#+end_src


*** org-templates
:PROPERTIES:
:ID:       d7e94dca-ca07-4b65-ac10-517ac8e551f1
:END:

#+begin_src emacs-lisp :tangle  "./modules/private/my-org/config.el"
;; (defun org-roam-dailies-capture-today ()
;;   "Capture a note into the daily note for today."
;;   (interactive)
;;   (let ((org-roam-capture-templates org-roam-dailies-capture-templates)
;;         (org-roam-capture--info (list (cons 'time (current-time))))
;;         (org-roam-capture--context 'dailies))
;;     (org-roam--capture)))

;; (setq org-capture-templates '(("n" "Note" entry (function org-roam-dailies-capture-today)
;;                                  "* %?\n")))
#+end_src

** org-journal
#+begin_src emacs-lisp :tangle "./modules/private/my-org/config.el"
(use-package! org-journal
  :config
  (setq org-journal-dir "~/Documents/org-notes/braindump/journals")
  (setq org-journal-file-format "%Y_%m_%d.org")
  )

#+end_src

** gkroam
#+begin_src emacs-lisp :tangle  "./modules/private/my-org/packages.el"
;;(package! gkroam :recipe (:host github :repo "Kinneyzhang/gkroam"))
#+end_src

#+begin_src emacs-lisp :tangle "./modules/private/my-org/config.el"
;; (use-package gkroam
;;   :hook (after-init . gkroam-mode)
;;   :init
;;   (setq gkroam-root-dir "~/Documents/org-notes/braindump")
;;   (setq gkroam-prettify-page-p t
;;         gkroam-show-brackets-p nil
;;         gkroam-use-default-filename t
;;         gkroam-window-margin 4)
;;   )
#+end_src

** org-brain

#+begin_src emacs-lisp :tangle  "./modules/private/my-org/packages.el"
(package! org-brain :recipe (:build (:not compile)))
#+end_src

#+begin_src emacs-lisp :tangle "./modules/private/my-org/config.el"
(use-package! org-brain
  :config
  (setq org-brain-visualize-default-choices 'all
        org-brain-title-max-length 24
        org-brain-include-file-entries nil
        org-brain-file-entries-use-title nil)
  (setq org-brain-path "~/Documents/org-notes/braindump")
  )
#+end_src

** ob-mermaid

- [[https://github.com/arnm/ob-mermaid][GitHub - arnm/ob-mermaid: Generate mermaid diagrams within Emacs org-mode babel]]
#+begin_src emacs-lisp :tangle  "./modules/private/my-org/packages.el"
(package! ob-mermaid)
#+end_src

#+begin_src emacs-lisp :tangle  "./modules/private/my-org/config.el"
(use-package! ob-mermaid
  :config
  (setq ob-mermaid-cli-path "~/.nix-profile/bin/mmdc")
  )
#+end_src


** org-spacer :edit:

- [[https://github.com/dustinlacewell/org-spacer.el][dustinlacewell/org-spacer.el: Enforce the number of blank lines between elements in an org-mode document]]

#+begin_src emacs-lisp :tangle  "./modules/private/my-org/packages.el"
(package! org-spacer.el :recipe (:host github :repo "dustinlacewell/org-spacer.el"))
#+end_src

#+begin_src emacs-lisp :tangle "./modules/private/my-org/config.el"
;; (use-package! org-spacer
;;   :config
;;   ;; (add-hook 'org-mode-hook
;;   ;;           (lambda () (add-hook 'before-save-hook
;;   ;;                                'org-spacer-enforce nil 'make-it-local)))
;;   )
#+end_src


** org-density.el :summary:statistic:

- [[https://github.com/mtekman/org-density.el][mtekman/org-density.el: Examine the density of org headings]]

#+begin_src emacs-lisp :tangle  "./modules/private/my-org/packages.el"
(package! org-treeusage :recipe (:host github :repo "mtekman/org-treeusage.el"))
#+end_src

#+begin_src emacs-lisp :tangle "./modules/private/my-org/config.el"
(use-package! org-treeusage
  :config
  (define-key org-mode-map (kbd "C-c d") 'org-treeusage-mode)
  )

#+end_src


** org-format

*** org-link-type

#+begin_src emacs-lisp :tangle "./modules/private/my-org/setting.el"
;; (defun endless/export-audio-link (path desc format)
;;   "Export org audio links to hmtl."
;;   (cl-case format
;;     (html (format
;;        "<audio preload=\"auto\"> <source src=\"https://www.gtrun.org/music/%s\">%s</audio>"
;;        path (or desc "")))

;;     ;; README: hugo music file path
;;     (md (format
;;      "<audio class=\"wp-audio-shortcode\"  loop=\"1\"  preload=\"auto\" style=\"width: 100%%;\" controls> <source src=\"https://www.gtrun.org/music/%s\">%s</audio>"
;;      path (or desc "")))
;;     (latex (format "(HOW DO I EXPORT AUDIO TO LATEX? \"%s\")" path))))

;; (after! org
;;   (org-add-link-type "audio" #'ignore #'endless/export-audio-link)
;;   ;;(setq org-download-timestamp "%Y%m%d_%H%M%S")
;; )
#+end_src

*** [[https://github.com/ianxm/emacs-scrum][ianxm/emacs-scrum: dynamic scrum report generation for org-mode buffers]]


