users/dotfiles/doom-emacs/modules/private/my-org/packages.el

;;(package! org-roam-server)

;;(package! org-roam-bibtex)

(package! nroam :recipe (:host github :repo "NicolasPetton/nroam"))

(package! org-ref)

;;(package! gkroam :recipe (:host github :repo "Kinneyzhang/gkroam"))

(package! org-brain :recipe (:build (:not compile)))

(package! ob-mermaid)

(package! org-spacer.el :recipe (:host github :repo "dustinlacewell/org-spacer.el"))

(package! org-treeusage :recipe (:host github :repo "mtekman/org-treeusage.el"))

(package! org-super-links :recipe (:host github
