users/dotfiles/doom-emacs/config.org
** org-super-links
:PROPERTIES:
:ID:       1761cf4f-5d3a-4e22-adb1-6b1e4114830b
:END:

- [[https://github.com/toshism/org-super-links][toshism/org-super-links: Package to create links with auto backlinks]]

#+begin_src emacs-lisp :tangle  "./modules/private/my-org/packages.el"
(package! org-super-links :recipe (:host github
                       :repo "toshism/org-super-links"
                       :files ("*.el")
                       ))
#+end_src

#+begin_src emacs-lisp :tangle "./modules/private/my-org/config.el"
(use-package! org-super-links
  :config
  (defun org-super-links-backlink-prefix-timestamp ()
  "Return the default prefix string for a backlink.
Inactive timestamp formatted according to `org-time-stamp-formats' and
a separator ' <- '."
  (let* ((time-format (substring (cdr org-time-stamp-formats) 1 -1))
	 (time-stamp (format-time-string time-format (current-time))))
    (format " - [%s] <- "
	    time-stamp)))

(defun org-super-links-link-prefix-timestamp ()
  "Return the default prefix string for a backlink.
Inactive timestamp formatted according to `org-time-stamp-formats' and
a separator ' -> '."
  (let* ((time-format (substring (cdr org-time-stamp-formats) 1 -1))
	 (time-stamp (format-time-string time-format (current-time))))
    (format " - [%s] -> "
	    time-stamp)))

(defun org-super-links-quick-insert-inline-link ()
  "Insert inline link regardless of variable `org-super-links-related-into-drawer' value."
  (interactive)
  ;; how to handle prefix here?
  (let ((org-super-links-related-into-drawer nil)
	(org-super-links-link-prefix 'org-super-links-link-prefix-timestamp))
    (org-super-links-link)))

(defun org-super-links-quick-insert-drawer-link ()
  "Insert link into drawer regardless of variable `org-super-links-related-into-drawer' value."
  (interactive)
  ;; how to handle prefix here?
  (let ((org-super-links-related-into-drawer (or org-super-links-related-into-drawer nil))
	(org-super-links-link-prefix 'org-super-links-backlink-prefix-timestamp))
    (org-super-links-link)))

(setq org-id-link-to-org-use-id
        'create-if-interactive-and-no-custom-id)

  (setq org-super-links-related-into-drawer nil
        org-super-links-backlink-into-drawer nil
        org-super-links-link-prefix 'org-super-links-link-prefix-timestamp)
  )
  #+end_src


** org-wiki

#+begin_src emacs-lisp :tangle  "./modules/private/my-org/packages.el"
(package! wikinfo :recipe (:host github
                             :repo "progfolio/wikinfo"
                             ))

(package! wikinforg :recipe (:host github
                             :repo "progfolio/wikinforg"
                             ))

#+end_src

#+begin_src emacs-lisp :tangle "./modules/private/my-org/config.el"
(use-package! wikinfo)
(use-package! wikinforg)
#+end_src


** org-noter-plus

#+begin_src emacs-lisp :tangle  "./modules/private/my-org/packages.el"
(package! org-noter-plus :recipe (:host github :repo "yuchen-lea/org-noter-plus"))
#+end_src

#+begin_src emacs-lisp :tangle "./modules/private/my-org/config.el"
(use-package! org-noter-plus
  :config
  (setq org-noter-plus-image-dir "~/Documents/org-notes/braindump/.attach")
)
#+end_src

** org-ipynb
#+begin_src emacs-lisp :tangle  "./modules/private/my-org/packages.el"
(package! ox-ipynb :recipe (:host github :repo "jkitchin/ox-ipynb"))
#+end_src

#+begin_src emacs-lisp :tangle "./modules/private/my-org/config.el"
(use-package! ox-ipynb)
#+end_src


** org-html-theme


#+begin_src emacs-lisp :tangle  "./modules/private/my-org/packages.el"
(package! org-html-themify :recipe (:host github :repo "DogLooksGood/org-html-themify"
                                    :files ("*.el" "*.js" "*.css")))
#+end_src

#+begin_src emacs-lisp :tangle "./modules/private/my-org/config.el"
;; (use-package! org-html-themify
;;   :hook (org-mode . org-html-themify-mode)
;;   :custom
;;   (org-html-themify-themes
;;    '((dark . doom-one)
;;      (light . doom-one)))
;;   )

#+end_src

** org-clones

1.

   [[https://github.com/legalnonsense/org-clones][legalnonsense/org-clones: Prototype for method of cloning orgmore headers]]

** [[https://github.com/stardiviner/org-link-beautify][stardiviner/org-link-beautify: Beautify org links with colors and icons.]]

#+begin_src emacs-lisp :tangle  "./modules/private/my-org/packages.el"
(package! org-link-beautify :recipe (:host github
                             :repo "stardiviner/org-link-beautify"
                             ))

#+end_src

#+begin_src emacs-lisp :tangle "./modules/private/my-org/config.el"
(use-package! org-link-beautify
  :config
  (add-hook! 'org-mode-hook 'org-link-beautify-mode)
  )

#+end_src

** TODO [[https://github.com/marcIhm/org-working-set][marcIhm/org-working-set: Manage a working-set of org-nodes]] :manage:

#+begin_src emacs-lisp :tangle  "./modules/private/my-org/packages.el"
(package! org-working-set
)
#+end_src

#+begin_src emacs-lisp :tangle "./modules/private/my-org/config.el"
(use-package! org-working-set)
#+end_src

** [[https://github.com/mtekman/org-tanglesync.el][mtekman/org-tanglesync.el: A package to pull external changes into an org-mode source block if that block is tangled to an external file]]

#+begin_src emacs-lisp :tangle  "./modules/private/my-org/packages.el"
(package! org-tanglesync)
#+end_src

#+begin_src emacs-lisp :tangle "./modules/private/my-org/config.el"
(use-package! org-tanglesync
  :bind
  (( "C-c M-i" . org-tanglesync-process-buffer-interactive)
   ( "C-c M-a" . org-tanglesync-process-buffer-automatic))
  )
#+end_src


** TODO [[https://github.com/casouri/valign][casouri/valign: Pixel-perfect visual alignment for Org and Markdown tables.]]

** TODO [[https://github.com/lepisma/org-krita][lepisma/org-krita: Krita sketches in Org]]

** [[https://github.com/alphapapa/org-graph-view][alphapapa/org-graph-view: View Org buffers as a clickable, graphical mind-map]]

#+begin_src emacs-lisp :tangle "./modules/private/my-org/packages.el"
;; (package! org-graph-view :recipe (:host github :repo "alphapapa/org-graph-view"))

#+end_src

#+begin_src emacs-lisp :tangle "./modules/private/my-org/config.el"
;;(use-package! org-graph-view)
#+end_src


** [[https://github.com/the-humanities/org-mind-map][the-humanities/org-mind-map: This is an emacs package that creates graphviz directed graphs.]]

#+begin_src emacs-lisp :tangle "./modules/private/my-org/packages.el"
(package! org-mind-map :recipe (:host github :repo "the-humanities/org-mind-map"))
#+end_src

#+begin_src emacs-lisp :tangle "./modules/private/my-org/config.el"
(use-package! org-mind-map
  :init
  (require 'ox-org)
  :config
  (setq org-mind-map-engine "circo")
  )
#+end_src

#+RESULTS:
: t


** org-parse

 - [[http://ergoemacs.org/emacs/elisp_parse_org_mode.html][Elisp: Parse Org Mode]]

* my-codes

** Initialize packages

#+begin_src emacs-lisp :tangle "./modules/private/my-code/packages.el"
;;; modules/private/my-code/packages/packages.el -*- lexical-binding: t; -*-
#+end_src

#+begin_src emacs-lisp :tangle "./modules/private/my-code/config.el"
;;; config..el -*- lexical-binding: t; -*-
#+end_src

** Latex

#+begin_src emacs-lisp :tangle "./modules/private/my-code/config.el"
(load! "my-latex")
#+end_src

*** auctex

*** chinese-latex


"./modules/private/my-code/my-latex.el"
(after! latex
      (add-to-list 'org-latex-classes '("article" "\\documentclass[a4paper,11pt]{article}
        [NO-DEFAULT-PACKAGES]
          \\usepackage[utf8]{inputenc}
          \\usepackage[T1]{fontenc}
          \\usepackage{fixltx2e}
          \\usepackage{graphicx}
          \\usepackage{longtable}
          \\usepackage{float}
          \\usepackage{wrapfig}
          \\usepackage{rotating}
          \\usepackage[normalem]{ulem}
          \\usepackage{amsmath}
          \\usepackage{textcomp}
          \\usepackage{marvosym}
          \\usepackage{wasysym}
          \\usepackage{amssymb}
          \\usepackage{booktabs}
          \\usepackage[colorlinks,linkcolor=black,anchorcolor=black,citecolor=black]{hyperref}
          \\tolerance=1000
          \\usepackage{listings}
          \\usepackage{xcolor}
          \\usepackage{fontspec}
          \\usepackage{xeCJK}
          \\setCJKmainfont{Weibei SC}
          \\setmainfont{Fantasque Sans Mono}
          \\lstset{
          %行号
          numbers=left,
          %背景框
          framexleftmargin=10mm,
          frame=none,
          %背景色
          %backgroundcolor=\\color[rgb]{1,1,0.76},
          backgroundcolor=\\color[RGB]{245,245,244},
          %样式
          keywordstyle=\\bf\\color{blue},
          identifierstyle=\\bf,
          numberstyle=\\color[RGB]{0,192,192},
          commentstyle=\\it\\color[RGB]{0,96,96},
          stringstyle=\\rmfamily\\slshape\\color[RGB]{128,0,0},
          %显示空格
          showstringspaces=false
          }
          "
                                        ("\\section{%s}" . "\\section*{%s}")
                                        ("\\subsection{%s}" . "\\subsection*{%s}")
                                        ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
                                        ("\\paragraph{%s}" . "\\paragraph*{%s}")
                                        ("\\subparagraph{%s}" . "\\subparagraph*{%s}")))

      ;; {{ export org-mode in Chinese into PDF
      ;; @see http://freizl.github.io/posts/tech/2012-04-06-export-orgmode-file-in-Chinese.html
      ;; and you need install texlive-xetex on different platforms
      ;; To install texlive-xetex:
      ;;    `sudo USE="cjk" emerge texlive-xetex` on Gentoo Linux
      ;; }}
      ;;(setq org-latex-default-class "ctexart")
    (add-to-list 'org-latex-packages-alist '("" "minted"))
    (setq org-latex-listings 'minted)
    (setq org-src-fontify-natively t)
    (setq org-latex-pdf-process
            '("xelatex -shell-escape -interaction nonstopmode -output-directory %o %f"
              "xelatex -shell-escape -interaction nonstopmode -output-directory %o %f"
              "xelatex -shell-escape -interaction nonstopmode -output-directory %o %f"
              "xelatex -interaction nonstopmode -output-directory %o %f"
              "xelatex -interaction nonstopmode -output-directory %o %f"
              "xelatex -interaction nonstopmode -output-directory %o %f"
              "rm -fr %b.out %b.log %b.tex auto"))
)
#+end_src

*** org-latex-instant-preview

#+begin_src emacs-lisp :tangle  "./modules/private/my-code/packages.el"
(package! org-latex-impatient :recipe (:host github :repo "yangsheng6810/org-latex-impatient"))
#+end_src

#+begin_src emacs-lisp :tangle  "./modules/private/my-code/my-latex.el"
(use-package org-latex-impatient
  ;;:hook (org-mode . org-latex-instant-preview-mode)
  :config
  (add-hook 'org-latex-impatient-mode-hook (lambda () (awesome-tab-mode -1)))

  (when IS-LINUX
    (setq org-latex-impatient-tex2svg-bin "/run/current-system/sw/bin/tex2svg")
    (setq org-latex-impatient-scale 10.0)
    )

  (when IS-MAC
    (setq org-latex-impatient-tex2svg-bin
          "~/.nix-profile/bin/tex2svg")
    (setq org-latex-impatient-scale 5.0)
    )
  )
#+end_src

** Haskell

