users/dotfiles/doom-emacs/modules/private/my-code/packages.el
;;; modules/private/my-code/packages/packages.el -*- lexical-binding: t; -*-

(package! org-latex-impatient :recipe (:host github :repo "yangsheng6810/org-latex-impatient"))
