users/dotfiles/doom-emacs/modules/private/my-org/packages.el
                       :repo "toshism/org-super-links"
                       :files ("*.el")
                       ))

(package! wikinfo :recipe (:host github
                             :repo "progfolio/wikinfo"
                             ))

(package! wikinforg :recipe (:host github
                             :repo "progfolio/wikinforg"
                             ))

(package! org-noter-plus :recipe (:host github :repo "yuchen-lea/org-noter-plus"))

(package! ox-ipynb :recipe (:host github :repo "jkitchin/ox-ipynb"))

(package! org-html-themify :recipe (:host github :repo "DogLooksGood/org-html-themify"
                                    :files ("*.el" "*.js" "*.css")))

(package! org-link-beautify :recipe (:host github
                             :repo "stardiviner/org-link-beautify"
                             ))

(package! org-working-set
)

(package! org-tanglesync)

;; (package! org-graph-view :recipe (:host github :repo "alphapapa/org-graph-view"))

(package! org-mind-map :recipe (:host github :repo "the-humanities/org-mind-map"))
