users/dotfiles/doom-emacs/config.org
*** lsp-haskell

#+begin_src emacs-lisp :tangle "./modules/private/my-code/packages.el"
(package! lsp-haskell)
#+end_src

#+begin_src emacs-lisp :tangle "./modules/private/my-code/config.el"
(use-package! lsp-haskell
  :config
  (add-hook 'haskell-mode-hook #'lsp)
  (add-hook 'haskell-literate-mode-hook #'lsp)
)
#+end_src

** Ccls

#+begin_src emacs-lisp :tangle "./modules/private/my-code/config.el"
(use-package! ccls
  :hook ((c-mode c++-mode objc-mode cuda-mode) .
         (lambda () (require 'ccls) (lsp)))
  )
#+end_src

** Poly Mode

- [[https://github.com/ShuguangSun/ess-view-data][ShuguangSun/ess-view-data: View data support for ESS]]

#+begin_src emacs-lisp :tangle "packages.el"
(unpin! polymode)
#+end_src



#+begin_src emacs-lisp :tangle "./modules/private/my-code/config.el"
(use-package! polymode
:config
  (add-hook 'org-brain-visualize-mode-hook #'org-brain-polymode)
)
#+end_src

*** Poly Mode Markdown

#+begin_src emacs-lisp :tangle "packages.el"
(package! poly-markdown :recipe (:build (:not compile)))
#+end_src


#+begin_src emacs-lisp :tangle "./modules/private/my-code/config.el"
(use-package! poly-markdown
  :config
  (add-to-list 'auto-mode-alist '("\\.Rmd" . poly-markdown-mode))
)
#+end_src

*** Poly Org Mode

#+begin_src emacs-lisp :tangle "./modules/poly-org.el"
;;; poly-org.el --- Polymode for org-mode -*- lexical-binding: t -*-
;;
;; Author: Vitalie Spinu
;; Maintainer: Vitalie Spinu
;; Copyright (C) 2013-2020 Vitalie Spinu
;; Version: 0.2.2
;; Package-Requires: ((emacs "25") (polymode "0.2.2"))
;; URL: https://github.com/polymode/poly-org
;; Keywords: languages, multi-modes
;;
;; ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;
;; This file is *NOT* part of GNU Emacs.
;;
;; This program is free software; you can redistribute it and/or
;; modify it under the terms of the GNU General Public License as
;; published by the Free Software Foundation; either version 3, or
;; (at your option) any later version.
;;
;; This program is distributed in the hope that it will be useful,
;; but WITHOUT ANY WARRANTY; without even the implied warranty of
;; MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
;; General Public License for more details.
;;
;; You should have received a copy of the GNU General Public License
;; along with this program; see the file COPYING.  If not, write to
;; the Free Software Foundation, Inc., 51 Franklin Street, Fifth
;; Floor, Boston, MA 02110-1301, USA.
;;
;; ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;
;;; Commentary:
;;
;; ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;
;;; Code:

(require 'polymode)
(require 'org)
(require 'org-src)

(define-obsolete-variable-alias 'pm-host/org 'poly-org-hostmode "v0.2")
(define-obsolete-variable-alias 'pm-inner/org 'poly-org-innermode "v0.2")

(defun poly-org-mode-matcher ()
  (let ((case-fold-search t))
    (when (re-search-forward "#\\+begin_\\(src\\|example\\|export\\) +\\([^ \t\n]+\\)" (point-at-eol) t)
      (let ((lang (match-string-no-properties 2)))
        (or (cdr (assoc lang org-src-lang-modes))
            lang)))))

(defvar ess-local-process-name)
(defun poly-org-convey-src-block-params-to-inner-modes (_ this-buf)
  "Move src block parameters to innermode specific locals.
Used in :switch-buffer-functions slot."
  (cond
   ((derived-mode-p 'ess-mode)
    (with-current-buffer (pm-base-buffer)
      (let* ((params (nth 2 (org-babel-get-src-block-info t)))
             (session (cdr (assq :session params))))
        (when (and session (org-babel-comint-buffer-livep session))
          (let ((proc (buffer-local-value 'ess-local-process-name
                                          (get-buffer session))))
            (with-current-buffer this-buf
              (setq-local ess-local-process-name proc)))))))))

(define-hostmode poly-org-hostmode
  :mode 'org-mode
  :protect-syntax nil
  :protect-font-lock nil)

(define-auto-innermode poly-org-innermode
  :fallback-mode 'host
  :head-mode 'host
  :tail-mode 'host
  :head-matcher "^[ \t]*#\\+begin_\\(src\\|example\\|export\\) .*\n"
  :tail-matcher "^[ \t]*#\\+end_\\(src\\|example\\|export\\)"
  :mode-matcher #'poly-org-mode-matcher
  :head-adjust-face nil
  :switch-buffer-functions '(poly-org-convey-src-block-params-to-inner-modes)
  :body-indent-offset 'org-edit-src-content-indentation
  :indent-offset 'org-edit-src-content-indentation)

(define-polymode poly-org-mode
  :hostmode 'poly-org-hostmode
  :innermodes '(poly-org-innermode)
  (setq-local org-src-fontify-natively nil)
  (make-local-variable 'polymode-move-these-minor-modes-from-old-buffer)
  (push 'org-indent-mode polymode-move-these-minor-modes-from-old-buffer))

(provide 'poly-org)
;;; poly-org.el ends here
#+end_src


#+begin_src emacs-lisp :tangle "packages.el"
;; (package! poly-org :recipe (:host github
;;                             :repo "polymode/poly-org"
;;                             :build (:not compile)
;;                             ))
(package! poly-org   :recipe (:local-repo "./modules"
                              :build (:not compile))
)
#+end_src


#+begin_src emacs-lisp :tangle "config.el"
(use-package! poly-org
  :commands poly-org-mode)
#+end_src

** Elisp

*** TODO [[https://github.com/doublep/eldev][doublep/eldev: Elisp Development Tool]]
*** TODO [[https://github.com/emacs-elsa/Elsa][emacs-elsa/Elsa: Emacs Lisp Static Analyzer]]

*** [[https://github.com/twlz0ne/elpl][twlz0ne/elpl: Provides a simple interface to evaluating Emacs Lisp expressions but without contaminating current Emacs.]]

** Scheme

- https://gitlab.com/jaor/geiser

#+begin_src emacs-lisp :tangle "packages.el"
;;(package! geiser)
#+end_src

#+begin_src emacs-lisp :tangle "config.el"
;; (use-package! geiser
;;   :config
;;   (setq geiser-default-implementation 'racket)
;; )
#+end_src

** Julia

*** [[https://github.com/gcv/julia-snail][julia-snail: An Emacs development environment for Julia]]

*** lsp-julia

- pin "716e7d99a30b26012e5711fb2f33bea71a7bc5ab" to master
  #+begin_src emacs-lisp :tangle "./modules/private/my-code/packages.el"
(package! lsp-julia :recipe (:host github :repo "non-Jedi/lsp-julia"))
#+end_src

#+begin_src emacs-lisp :tangle "./modules/private/my-code/config.el"
(use-package! lsp-julia
  :config
  ;;(add-hook 'julia-mode-hook #'lsp)
  ;;(setq lsp-julia-default-environment "~/.julia/environments/v1.5")
  (setq lsp-folding-range-limit 100)
)
#+end_src

*** [[https://github.com/gcv/julia-snail][gcv/julia-snail: An Emacs development environment for Julia]]
  #+begin_src emacs-lisp :tangle "./modules/private/my-code/packages.el"
(package! julia-snail :recipe (:host github
                                   :repo "gcv/julia-snail"
                                   :files ("*")
                                   ))
#+end_src

#+begin_src emacs-lisp :tangle "./modules/private/my-code/config.el"
(use-package! julia-snail
  :config
  :requires vterm
  :hook (julia-mode . julia-snail-mode)
  )
#+end_src

*** Julia conf

#+begin_src emacs-lisp :tangle "config.el"
(add-hook 'ob-async-pre-execute-src-block-hook
          '(lambda ()
             (setq inferior-julia-program-name "julia")))
#+end_src

** Python

#+begin_src emacs-lisp :tangle "./modules/private/my-code/packages.el"
(package! lsp-pyright)
#+end_src

#+begin_src emacs-lisp :tangle "./modules/private/my-code/config.el"
(setq flycheck-python-pylint-executable "pylint")
(use-package! lsp-pyright
  :config
  (setq lsp-clients-python-command "pyright")
  :hook (python-mode . (lambda ()
                         (require 'lsp-pyright)
                         (lsp))))
#+end_src

** Nox

#+begin_src emacs-lisp :tangle "./modules/private/my-code/packages.el"
;;(package! nox :recipe (:host github :repo "manateelazycat/nox"))
#+end_src

#+begin_src emacs-lisp :tangle "./modules/private/my-code/config.el"
;; (use-package! nox
;;   :config
;;   (add-to-list 'nox-server-programs '(haskell-mode . ("ghcide" "--lsp")))
  ;; (dolist (hook (list
  ;;                'js-mode-hook
  ;;                'rust-mode-hook
  ;;                'python-mode-hook
  ;;                'ruby-mode-hook
  ;;                'java-mode-hook
  ;;                'sh-mode-hook
  ;;                'php-mode-hook
  ;;                'c-mode-common-hook
  ;;                'c-mode-hook
  ;;                'c++-mode-hook
  ;;                'haskell-mode-hook
  ;;                ))
  ;;   (add-hook hook '(lambda () (nox-ensure))))
  ;; )
#+end_src

** Zeek Mode

#+begin_src emacs-lisp :tangle "./modules/private/my-code/packages.el"
(package! zeek-mode :recipe (:host github :repo "ynadji/zeek-mode"))
#+end_src

#+begin_src emacs-lisp :tangle "./modules/private/my-code/config.el"
(use-package! zeek-mode
  :config
  (setq default-tab-width 4)
  (defun add-company-tabnine ()
    (add-to-list (make-local-variable 'company-backends) 'company-tabnine))
  (add-hook 'zeek-mode-hook #'add-company-tabnine)
  )
#+end_src

#+RESULTS:
: t


** Nix Mode

#+begin_src emacs-lisp :tangle "./modules/private/my-code/config.el"
(use-package! nix-mode
  :config
  (setq-hook! 'nix-mode-hook company-idle-delay t)
  )
#+end_src

** Rust
#+begin_src emacs-lisp :tangle "./modules/private/my-code/config.el"
(after! rust
  (seqpetq racer-cmd "racer")
  (add-hook 'rustic-mode-hook (lambda () (setq-local +lsp-company-backends '(company-capf
                                                                             company-tabnine))
                                ))
  )
#+end_src

** separedit.el
#+begin_src emacs-lisp :tangle "./modules/private/my-code/packages.el"
(package! separedit :recipe (:host github :repo "twlz0ne/separedit.el"))
#+end_src

#+begin_src emacs-lisp :tangle "./modules/private/my-code/config.el"
;; 
(use-package! separedit
  :config
  (define-key prog-mode-map        (kbd "C-x '") #'separedit)
  (define-key minibuffer-local-map (kbd "C-x '") #'separedit)
  (define-key org-src-mode-map     (kbd "C-x '") #'separedit)
  )
#+end_src

** Tree Sitter

#+begin_src emacs-lisp :tangle "./modules/private/my-code/config.el"
(when IS-LINUX
  (use-package! emacs-tree-sitter
    :load-path "~/src/emacs-plugin/emacs-tree-sitter/lisp"
    :hook (rustic-mode . tree-sitter-mode)
    :init
    (add-to-list 'load-path "~/src/emacs-plugin/emacs-tree-sitter/core")
    (add-to-list 'load-path "~/src/emacs-plugin/emacs-tree-sitter/langs")
    (require 'tree-sitter)
    (require 'tree-sitter-langs)
    :config
    (tree-sitter-require 'rust)
    (tree-sitter-require 'python)
    (tree-sitter-require 'julia)
    )
  (add-hook 'tree-sitter-after-on-hook #'tree-sitter-hl-mode)
  )
#+end_src

#+RESULTS:
| tree-sitter-hl-mode |

* Visual


** Buffer

*** Parenthesis

#+begin_src emacs-lisp :tangle "config.el"
(use-package! rainbow-delimiters
  :config
  (custom-set-faces
   '(rainbow-delimiters-mismatched-face ((t (:foreground "white" :background "red" :weight bold))))
   '(rainbow-delimiters-unmatched-face ((t (:foreground "white" :background "red" :weight bold))))

   ;; show parents (in case of rainbow failing !)
   '(show-paren-match ((t (:foreground "white" :background "green" :weight bold))))
   '(show-paren-mismatch ((t (:foreground "white" :background "red" :weight bold)))))
  (add-hook 'prog-mode-hook #'rainbow-delimiters-mode)
;; highlight brackets
  )

#+end_src

*** eysbrowse

#+begin_src emacs-lisp :tangle "packages.el"
(package! eyebrowse)
#+end_src

#+begin_src emacs-lisp :tangle "config.el"
(use-package! eyebrowse
  :hook (after-init . eyebrowse-mode)
  :config
  (define-key eyebrowse-mode-map (kbd "M-1") 'eyebrowse-switch-to-window-config-1)
  (define-key eyebrowse-mode-map (kbd "M-2") 'eyebrowse-switch-to-window-config-2)
  (define-key eyebrowse-mode-map (kbd "M-3") 'eyebrowse-switch-to-window-config-3)
  (define-key eyebrowse-mode-map (kbd "M-4") 'eyebrowse-switch-to-window-config-4)
  (define-key eyebrowse-mode-map (kbd "M-5") 'eyebrowse-switch-to-window-config-5)
  (setq eyebrowse-new-workspace t)
)
 #+end_src
** window

