users/dotfiles/doom-emacs/modules/private/my-code/packages.el

(package! lsp-haskell)

(package! lsp-julia :recipe (:host github :repo "non-Jedi/lsp-julia"))

(package! julia-snail :recipe (:host github
                                   :repo "gcv/julia-snail"
                                   :files ("*")
                                   ))

(package! lsp-pyright)

;;(package! nox :recipe (:host github :repo "manateelazycat/nox"))

(package! zeek-mode :recipe (:host github :repo "ynadji/zeek-mode"))

(package! separedit :recipe (:host github :repo "twlz0ne/separedit.el"))
