users/dotfiles/doom-emacs/config.org
*** awesome-tab

#+begin_src emacs-lisp :tangle "config.el"
(use-package! awesome-tab
  :config
  (awesome-tab-mode t)
  (setq awesome-tab-style 'slant)
  ;; winum users can use `winum-select-window-by-number' directly.
  (defun my-select-window-by-number (win-id)
    "Use `ace-window' to select the window by using window index.
WIN-ID : Window index."
    (let ((wnd (nth (- win-id 1) (aw-window-list))))
      (if wnd
          (aw-switch-to-window wnd)
        (message "No such window."))))

  (defun my-select-window ()
    (interactive)
    (let* ((event last-input-event)
           (key (make-vector 1 event))
           (key-desc (key-description key)))
      (my-select-window-by-number
       (string-to-number (car (nreverse (split-string key-desc "-")))))))

  (when (not (display-graphic-p))
    (setq frame-background-mode 'dark))
  (defun awesome-tab-buffer-groups ()
    "`awesome-tab-buffer-groups' control buffers' group rules.

Group awesome-tab with mode if buffer is derived from `eshell-mode' `emacs-lisp-mode' `dired-mode' `org-mode' `magit-mode'.
All buffer name start with * will group to \"Emacs\".
Other buffer group by `awesome-tab-get-group-name' with project name."
    (list
     (cond
      ((or (string-equal "*" (substring (buffer-name) 0 1))
           (memq major-mode '(magit-process-mode
                              magit-status-mode
                              magit-diff-mode
                              magit-log-mode
                              magit-file-mode
                              magit-blob-mode
                              magit-blame-mode
                              )))
       "Emacs")
      ((derived-mode-p 'eshell-mode)
       "EShell")
      ((derived-mode-p 'emacs-lisp-mode)
       "Elisp")
      ((derived-mode-p 'dired-mode)
       "Dired")
      ((memq major-mode '(org-mode org-agenda-mode diary-mode))
       "OrgMode")
      (t
       (awesome-tab-get-group-name (current-buffer))))))

  (defhydra awesome-fast-switch (:hint nil)
    "
 ^^^^Fast Move             ^^^^Tab                    ^^Search            ^^Misc
-^^^^--------------------+-^^^^---------------------+-^^----------------+-^^---------------------------
   ^_k_^   prev group    | _C-a_^^     select first | _b_ search buffer | _C-k_   kill buffer
 _h_   _l_  switch tab   | _C-e_^^     select last  | _g_ search group  | _C-S-k_ kill others in group
   ^_j_^   next group    | _C-j_^^     ace jump     | ^^                | ^^
 ^^0 ~ 9^^ select window | _C-h_/_C-l_ move current | ^^                | ^^
-^^^^--------------------+-^^^^---------------------+-^^----------------+-^^---------------------------
"
    ("h" awesome-tab-backward-tab)
    ("j" awesome-tab-forward-group)
    ("k" awesome-tab-backward-group)
    ("l" awesome-tab-forward-tab)
    ("0" my-select-window)
    ("1" my-select-window)
    ("2" my-select-window)
    ("3" my-select-window)
    ("4" my-select-window)
    ("5" my-select-window)
    ("6" my-select-window)
    ("7" my-select-window)
    ("8" my-select-window)
    ("9" my-select-window)
    ("C-a" awesome-tab-select-beg-tab)
    ("C-e" awesome-tab-select-end-tab)
    ("C-j" awesome-tab-ace-jump)
    ("C-h" awesome-tab-move-current-tab-to-left)
    ("C-l" awesome-tab-move-current-tab-to-right)
    ("b" ivy-switch-buffer)
    ("g" awesome-tab-counsel-switch-group)
    ("C-k" kill-current-buffer)
    ("C-S-k" awesome-tab-kill-other-buffers-in-current-group)
    ("q" nil "quit"))
  )
;; (setq awesome-tab-style "bar")
;; (setq awesome-tab-set-icons t)
;; (setq awesome-tab-set-bar t)
;; (setq awesome-tab-set-bar 'over)
;; (setq awesome-tab-set-modified-marker t)
;; (setq awesome-tab-set-close-button nil)
;; (setq awesome-tab-modified-marker "*")
(global-set-key (kbd "C-c j") 'awesome-tab-forward-tab)
(global-set-key (kbd "C-c k") 'awesome-tab-backward-tab)
(global-set-key (kbd "C-c o") 'awesome-tab-switch-group)
#+end_src

*** Dimming Unused Windows

#+begin_src emacs-lisp :tangle "packages.el"
(package! dimmer)
#+end_src

#+begin_src emacs-lisp :tangle "config.el"
(use-package! dimmer
  :config (dimmer-mode))
#+end_src

*** beacon

#+begin_src emacs-lisp :tangle "packages.el"
(package! beacon)
#+end_src

#+begin_src emacs-lisp :tangle "config.el"
(use-package! beacon
  :diminish
  :config (setq beacon-color "#666600")
  :hook   ((org-mode text-mode) . beacon-mode))
#+end_src

*** Flashing when something goes wrong —no blinking

#+begin_src emacs-lisp :tangle "config.el"
(setq visible-bell 1)
#+end_src

*** golden-ratio

#+begin_src emacs-lisp :tangle "config.el"
(use-package! golden-ratio
  :disabled
  :diminish golden-ratio-mode
  :init (golden-ratio-mode 1))
#+end_src

** theme

*** [[https://github.com/vbuzin/berrys-theme][vbuzin/berrys-theme: A light, clean and elegant Emacs theme]]

#+begin_src emacs-lisp :tangle yes
;; (use-package! berrys-theme
;;   :config
;;   (load-theme 'berrys t)

;;   :config ;; for good measure and clarity
;;   (setq-default cursor-type '(bar . 2))
;;   (setq-default line-spacing 2))
#+end_src

*** [[https://github.com/rougier/elegant-emacs][rougier/elegant-emacs: A very minimal but elegant emacs (I think)]]

** writeroom or writegood

- [[https://github.com/bnbeckwith/writegood-mode][bnbeckwith/writegood-mode: Minor mode for Emacs to improve English writing]]

- [[https://github.com/joostkremers/writeroom-mode][joostkremers/writeroom-mode: Writeroom-mode: distraction-free writing for Emacs.]]

- [[https://github.com/rnkn/olivetti][rnkn/olivetti: Emacs minor mode for a nice writing environment]]

#+begin_src emacs-lisp :tangle "packages.el"
(package! writeroom-mode)
#+end_src

#+begin_src emacs-lisp :tangle "config.el"
(use-package! writeroom-mode
  :hook
  (org-mode . writeroom-mode)
  (w3m-mode . writeroom-mode)
  :config
  (advice-add 'text-scale-adjust :after
              #'visual-fill-column-adjust)

  ;;https://github.com/joostkremers/writeroom-mode#fullscreen-effect
  (setq writeroom-fullscreen-effect 'maximized)
)
#+end_src

#+begin_src emacs-lisp :tangle "config.el"
;; (use-package! writegood-mode
;;   ;; Load this whenver I'm composing prose.
;;   ;;:hook (text-mode org-mode)
;;   ;; Don't show me the “Wg” marker in the mode line
;;   :diminish
;;   ;; Some additional weasel words.
;;   :config
;;   (--map (push it writegood-weasel-words)
;;          '("some" "simple" "simply" "easy" "often" "easily" "probably"
;;            "clearly"               ;; Is the premise undeniably true?
;;            "experience shows"      ;; Whose? What kind? How does it do so?
;;            "may have"              ;; It may also have not!
;;            "it turns out that")))  ;; How does it turn out so?
;;            ;; ↯ What is the evidence of highighted phrase? ↯
#+end_src

** grip-mode

1. [[https://github.com/seagle0128/grip-mode][seagle0128/grip-mode: Instant Github-flavored Markdown/Org preview using grip]]

** windown manager

1. [[https://github.com/nex3/perspective-el][nex3/perspective-el: Perspectives for Emacs.]]

** [[https://github.com/alphapapa/burly.el][alphapapa/burly.el: Save and restore frames and windows with their buffers in Emacs]]

** [[https://github.com/ashton314/emacs-writer][ashton314/emacs-writer: An elegant Emacs setup optimized for non-technical writers]]

* chinese

** pinyinlib

#+begin_src emacs-lisp :tangle "config.el"
(use-package! pinyinlib
  :config
  (defun re-builder-extended-pattern (str)
    (let* ((len (length str)))
      (cond
       ;; do nothing
       ((<= (length str) 0))

       ;; If the first charater of input in ivy is ":",
       ;; remaining input is converted into Chinese pinyin regex.
       ((string= (substring str 0 1) ":")
        (setq str (pinyinlib-build-regexp-string (substring str 1 len) t)))

       ;; If the first charater of input in ivy is "/",
       ;; remaining input is converted to pattrn to search camel case word
       ((string= (substring str 0 1) "/")
        (let* ((rlt "")
               (i 0)
               (subs (substring str 1 len))
               c)
          (when (> len 2)
            (setq subs (upcase subs))
            (while (< i (length subs))
              (setq c (elt subs i))
              (setq rlt (concat rlt (cond
                                     ((and (< c ?a) (> c ?z) (< c ?A) (> c ?Z))
                                      (format "%c" c))
                                     (t
                                      (concat (if (= i 0) (format "[%c%c]" (+ c 32) c)
                                                (format "%c" c))
                                              "[a-z]+")))))
              (setq i (1+ i))))
          (setq str rlt))))
      (ivy--regex-plus str)))

  (eval-after-load 'ivy
    '(progn
       ;; better performance on everything (especially windows), ivy-0.10.0 required
       ;; @see https://github.com/abo-abo/swiper/issues/1218
       (setq ivy-dynamic-exhibit-delay-ms 250)

       ;; Press C-p and Enter to select current input as candidate
       ;; https://oremacs.com/2017/11/30/ivy-0.10.0/
       (setq ivy-use-selectable-prompt t)

       (setq ivy-re-builders-alist
             '((t . re-builder-extended-pattern)))
       ;; set actions when running C-x b
       ;; replace "frame" with window to open in new window
       (ivy-set-actions
        'ivy-switch-buffer-by-pinyin
        '(("j" switch-to-buffer-other-frame "other frame")
          ("k" kill-buffer "kill")
          ("r" ivy--rename-buffer-action "rename")))))
  (with-eval-after-load "swiper-isearch"
    (setq ivy-re-builders-alist
          '((t . re-builder-extended-pattern)
            (t . ivy-prescient-re-builder))))
  )
#+end_src

** helm-pinyin

#+begin_src emacs-lisp :tangle "packages.el"
;; (package! helm-pinyin :recipe (:host github :repo "twlz0ne/helm-pinyin"))
#+end_src

#+begin_src emacs-lisp :tangle "config.el"
;; (use-package! helm-pinyin
;;   :hook
;;   (after-init . turn-on-helm-pinyin)
;;   )
#+end_src

* minor mode and major mode

** [[https://github.com/rnkn/binder][rnkn/binder: Emacs global minor mode facilitating multi-file writing projects]]

** [[https://github.com/jerrypnz/major-mode-hydra.el][jerrypnz/major-mode-hydra.el: Spacemacs-esque major mode leader key powered by Hydra]]

* Writing

** grammarly

#+begin_src emacs-lisp :tangle "packages.el"
;;(package! flycheck-grammarly :recipe (:host github :repo "jcs-elpa/flycheck-grammarly"))
(package! company-english-helper :recipe (:host github :repo "manateelazycat/company-english-helper"))
(package! emacs-powerthesaurus :recipe (:host github :repo "SavchenkoValeriy/emacs-powerthesaurus"))
#+end_src

#+begin_src emacs-lisp :tangle "config.el"
(use-package! company-english-helper)
;;(use-package! flycheck-grammarly)
#+end_src

** [[https://github.com/arnm/ob-mermaid][arnm/ob-mermaid: Generate mermaid diagrams within Emacs org-mode babel]]

** TODO [[https://github.com/zzkt/smog][zzkt/smog: Analyse the writing style, word use and readability of prose in Emacs.]] :writing:

**

** TODO [[https://github.com/rnkn/binder][rnkn/binder: Emacs global minor mode facilitating multi-file writing projects]]

* unload packages & unpin packages

** disbale-packages

#+begin_src emacs-lisp :tangle "packages.el"
(disable-packages! pyim)
(disable-packages! company-go)
(disable-packages! lsp-python-ms)
#+end_src

** unpin packages
#+begin_src emacs-lisp :tangle "packages.el"
(unpin! doom-modeline)
(unpin! magit)
(unpin! nix-mode)
(unpin! org-journal)
(unpin! lsp-mode)
#+end_src
* misc

** emacs-music

*** [[https://github.com/SpringHan/netease-cloud-music.el][SpringHan/netease-cloud-music.el: A netease music client for emacs.]]

* set popup rules

#+begin_src emacs-lisp :tangle "config.el"
;; (custom-set-faces
;;   '(awesome-tab-close-selected((t ( :foreground "DarkGray"))))
;;   )

(set-popup-rule! "^\\*org-graph-view" :side 'right :size 70 :quit nil :select t :ttl 0)

(set-popup-rule! "^\\*julia:main"
  :side 'right :size 0.3 :quit nil :select nil :ttl 0)

(set-popup-rule! "^\\*Ilist"
  :side 'right :size 35 :quit nil :select nil :ttl 0)

(after! org
  (set-popup-rule! "^\\*Org tags" :size 0.5))

(after! helm
  (set-popup-rule! "^\\*helm" :size 0.5))

(after! maple-explorer-imenu
(set-popup-rule! "^\\*maple-explorer-imenu"
  :side 'right :size 35 :quit nil :select nil :ttl 0)
)
#+end_src

#+RESULTS:

* Warning

#+begin_src emacs-lisp :tangle "config.el"
(add-to-list 'warning-suppress-types '(yasnippet backquote-change))
#+end_src

#+RESULTS:
| yasnippet | backquote-change |
| :warning  |                  |

* Fonts

** Chinese Font
#+begin_src emacs-lisp :tangle "config.el"
(use-package! cnfonts)
#+end_src

#+begin_src emacs-lisp :tangle "packages.el"
(package! cnfonts)
#+end_src

* Linux & MacOS

#+begin_src emacs-lisp :tangle "config.el"
(when IS-LINUX
  (load! "linux.el")
)
(when IS-MAC
  (load! "macos.el")
)
#+end_src

** Linux only

- cursor

#+begin_src emacs-lisp :tangle "linux.el"
(setq-default cursor-type 'box)
(blink-cursor-mode -1)
(set-cursor-color "IndianRed3")
#+end_src


- bookmark

#+begin_src emacs-lisp :tangle "linux.el"
(setq bm-repository-file (f-join doom-private-dir "etc/bm-linux-data"))
(setq bookmark-default-file
      (concat doom-private-dir "etc/bookmark-linux-default.el"))
(bookmark-load bookmark-default-file t)
#+end_src

- variables

#+begin_src emacs-lisp :tangle "linux.el"
(setq python-shell-interpreter "python")
(setq eaf-python-command "python")


(when (not window-system)
  (xterm-mouse-mode 1)
  )

(setq org-roam-db-location "~/.emacs.d/.local/cache/org-roam.db")
(setq org-crypt-key "24945FE0DBD04F4C045025F96F92B3E8F942D425")
#+end_src



#+begin_src emacs-lisp :tangle "linux.el"
;; (add-hook! 'emacs-startup-hook 'doom-modeline-mode)
;;fix post hook only linux
;; (require 'savehist)
;; (setq jupyter-runtime-directory "~/.local/share/jupyter/runtime")
#+end_src


*** eaf

#+begin_src emacs-lisp :tangle "packages.el"
(when IS-LINUX
  (package! epc :recipe (:build (:not compile)))
  (package! eaf :recipe (:host github
                            :repo "manateelazycat/emacs-application-framework"
                            :files ("*")
                            :build (:not compile)))
  )
#+end_src


#+begin_src emacs-lisp :tangle "config.el"
(when IS-LINUX
  (when (display-graphic-p)
    (use-package! eaf
      :if (eq system-type 'gnu/linux)
      :custom
      (eaf-find-alternate-file-in-dired t)
      :config
      (eaf-setq eaf-browser-default-zoom "2.0")

      (eaf-bind-key scroll_up "C-n" eaf-pdf-viewer-keybinding)
      (eaf-bind-key scroll_down "C-p" eaf-pdf-viewer-keybinding)

      (defun eaf-open-google ()
        "Open Google using EAF."
        (interactive)
        (eaf-open-browser "https://www.google.com")))

    (use-package! epc)
    )
  )
#+end_src

*** grab-x-link :nix:

#+begin_src emacs-lisp :tangle "config.el"
(use-package! grab-x-link
  :if (eq system-type 'gnu/linux)
  )
#+end_src

*** Font Setting

#+begin_src emacs-lisp :tangle "linux.el"
(set-face-attribute
 'default nil
 :font (font-spec :name "-PfEd-Fantasque Sans Mono-bold-italic-normal-*-*-*-*-*-m-0-iso10646-1"
                  :weight 'normal
                  :slant 'normal
                  :size 12.0))

(when (display-graphic-p)
  (dolist (charset '(kana han cjk-misc bopomofo))
    (set-fontset-font (frame-parameter nil 'font) charset
                      (font-spec :family "Weibei SC" :size 55)))
  )
#+end_src
*** Mode Map -> Linux

****  Org Mode Map

#+begin_src emacs-lisp :tangle "linux.el"
(map! :map org-mode-map
      "C-c l" 'grab-x-link
      )
#+end_src
** MacOS Linux
